import { Box, Container, Dialog, Typography } from "@mui/material";
import { makeStyles } from "@mui/styles";
import React from "react";

const useStyles = makeStyles({
  mainView: {
    textAlign: "right",
    
  },
  heading:{
    wordSpacing : 5,
    fontFamily : "fantasy"
  },
  list: {
    alignItems: "right",
  },
});

function Article_01() {
  const classes = useStyles();
  return (
    <>
      <Box mt={15}  >
        <Container className={classes.mainView}  >
          <Typography   variant="h4" className={classes.heading} mb={2}>
            : قرباني جانوروں کا ضیاع نہیں بلکہ باعث نجات ہے
          </Typography>
          <Typography variant="h5">
            لغۃ:لغت کے اعتبار سے قربانی اس چیز کا نام ہے جس کوقربانی کے دنوںمیں
            ذبح کیا جائے ۔ (لسان العرب لابن منظور)
          </Typography>
          <Typography variant="h5">
            اصطلاح شرع میں: مخصوص جانوروں کو مخصوص وقت میں قربانی کے دنوں میں
            ذبح کرنا (العناية شرح الهداية لمحمدبن احمد الحنفی) قرآن مجید میں
            قربانی کیلئے تین لفظ آئے ہیں۔ ایک نسک اور دوسرا نحر تیسرا قربان ۔
          </Typography>
          <Typography variant="h5">
            اللہ رب العزت کی بارگاہ میں قربانی کرنا ایساپسندیدہ عمل ہے جس کو
            باری تعالی نے آنے والی ہرامت کو یہ حکم دیا کہ وہ میری رضا حاصل
            کرنےلیے جانوروں کی قربانی پیش کرے تاکہ میری مخلوق میرے حکم کی مطیع
            ہو کرفرماں بردار بن جائےاور مخلوق پر یہ واضح ہوجائے کہ اللہ کے حکم
            کے آگے چون وچرا کی بجائے اس کے حکم کو بجا لایا جائے اور مخلوق کے
            اندر یہ صفت بھی پیداکرنا مقصود تھی کہ اللہ کے لیے جب جان کا نذرانہ
            پیش کرنے کا وقت آئے تو گریز نہیں کرنا چاہیے، جس طرح اللہ کی بارگاہ
            میں قربان کیے ہوئے جانوروں کامرتبہ عام جانوروں سے بارگاہ الہی میں
            بڑھ جاتا ہے ، اسی طرح باری تعالی کے حکم کو بجالانے والوں کا مرتبہ
            بھی اللہ تعالی کے ہاں عام لوگوں سے بڑھ جاتا ہے ۔
          </Typography>
          <Typography variant="h4" marginY={5}>
            : پہلی امتوں میں قربانی کا تصور
          </Typography>
          <Typography variant="h5">
            قربانی کا حکم اللہ تعالی نے ہرآنے والے نبی پر لاگو کیا اور اس طرح ہر
            نبی نے اللہ تعالی کے حکم کو بجا لانے میں کوئی کسر اٹھا نہ رکھی، اور
            ہر امت کے قربانی کے فریضہ کی ادائیگی کا تذکر ہ قرآن مجید میں اللہ
            تعالی نے رہتی دنیا تک کے لیے محفوظ فرما دیا۔
          </Typography>
          <Typography variant="h5">
            فرمان باری تعالی ہے: اور ہم نے ہر امت کے لئے قربانی مقرر کر دی ہے
            تاکہ وہ اللہ کا نام لیں ، ان جانوروں پر جو ہم نے ان کو عطا کئے
            ہیں(سورۃ الحج:34)
          </Typography>
          <Typography variant="h5">
            اور آپ پڑھ سنائیے انھیں خبر دو فرزندان آدم کی ٹھیک ٹھیک جب دونوں نے
            قربانی دی تو قبول کی گئی ایک سے اور نہ قبول کی گئی دوسرے سے (اس
            دوسرے نے) کہا قسم ہے میں تمھیں قتل کرڈالوں گا۔ (پہلے نہ) کہا (تو
            بلاوجہ ناراض ہوتا ہے) قبول فرماتا ہے اللہ صرف پرہیزگاروں
            سے۔(المائدۃ:27)
          </Typography>
          <Typography variant="h5">
            پیر کرم شاہ الازہری رحمۃ اللہ تعالی فرماتے ہیں یہاں قربان سے مراد
            کوئی جانور نہیں جو ذبح کیا گیا ہو بلکہ محض نذر خداوندی مراد ہے۔ خواہ
            وہ جنس کی شکل میں ہو یا کسی جانور کی قربانی کی صورت میں۔ بتایا یہ جا
            رہا ہے کہ حضرت آدم (علیہ السلام) کے دونوں بیٹوں (قابیل اور ہابیل) نے
            بارگاہ رب العزت میں نذرانہ عبودیت پیش کیا۔ اللہ تعالیٰ نے ایک
            (ہابیل) کی قربانی کو شرف قبول بخشا اور دوسرے (قابیل) کا نذرانہ
            نامنظور فرمایا۔ قابیل حسد کے مارے تڑپ اٹھا اور اس میں اپنی تحقیر اور
            تذلیل سمجھی کہ اس کی قربانی منظور ہوگئی اور میری مسترد کردی گئی۔
            چنانچہ اس نے کہا کہ ہابیل ! میں اس ذلت کو برداشت نہیں کرسکتا۔ اب
            تیری جان لئے بغیر مجھے تسکین نہیں ہو سکتی۔
          </Typography>
          <Typography variant="h5">
            ہابیل نے قابیل کو دھمکی کا جواب دیا کہ بھائی اس میں میری کیا خطا ہے۔
            اللہ کے ہاں تو اسی کا نذرانہ قبول کیا جاتا ہے جو متقی اور پرہیزگار
            ہو۔ گویا ہابیل نے اسے بتا دیا کہ اگر تم اپنی سابقہ زندگی میں اپنے رب
            کے نافرمان اور سرکش بنے رہے ہو جس کے باعث تمہیں یہ دن دیکھنا پڑا تو
            اب گزشتہ کرتوتوں پر اشک ندامت بہاؤ اور سچے دل سے توبہ کرلو اور آئندہ
            تقویٰ کی راہ پر گامزن رہو۔ رحمت خداوندی تمہاری قربانی بھی قبول کرلے
            گی۔ لیکن انسان کی یہ دیرینہ عادت ہے کہ وہ ایک غلطی پر دوسری شدید
            غلطی سے پر دہ ڈالنا چاہتا ہے۔ ایک گناہ کو چھپانے کے لئے اس سے بھی
            سنگین گناہ کرنے پر آمادہ ہوجاتا ہے۔ قابیل کے لئے آسان اور سلامتی کا
            راستہ تو وہی تھا جس کی طرف اس کے بھائی نے اس کی رہنمائی کی تھی۔ لیکن
            وہ اسے قبول کرنے کے لئے تیار نہ ہوا۔(تفسیر ضیاءالقرآن)
          </Typography>
          <Typography variant="h4" marginY={5}>
            : پہلی امتوں میں قربانیوں کے قبول ہونے کی علامت اور ہم پر اللہ کی
            رحمت
          </Typography>
          <Typography variant="h5">
            قرآن مجید کے مطابق پہلے انبیاءکے دور میں قربانی کے قبول ہونے یا نہ
            ہونے کی پہچان یہ تھی کہ جس قربانی کو اللہ تعالیٰ قبول فرما لیتے تو
            ایک آگ آسمان سے آتی اور اس کو جلا دیتی۔ ایسا ہی تب ہوا جب حضرت آدم
            علیہ الصلاۃ وا لسلام کے بیٹوں نے قربانی کی تو ہابیل کی قربانی قبول
            ہوگئی یعنی اس کو آسمان سے آگ آکر کھاگئی جبکہ قابیل کی ہوئی قربانی
            اللہ کی بارگاہ میں مقبول نہ ہوئی، تو یہی مطالبہ یہودیوں نے اس وقت
            کیا جب رسول اللہ نے مدینہ طیبہ میں مقیم یہودیوں کو ایمان لانے کی
            دعوت دی تو یہودیوں نے کہا:۔ ”یعنی اللہ تعالیٰ نے ہم سے یہ طے کر لیا
            ہے کہ ہم کسی رسول پر اس وقت تک ایمان نہ لائیں جب تک کہ وہ ہمارے پاس
            ایسی قربانی نہ لائے جسے آگ کھا لے “ (سورۃ آل عمران:183) حالانکہ یہ
            یہودکی انتہائی غلط بیانی تھی اور ان کے اس دعوےکا جواب اللہ تعالی نے
            خود عطا فرمادیا اسی آیت کے دوسرے حصہ میں ، فرمان باری تعالی ہے: تم
            فرما دو مجھ سے پہلے بہت رسول تمہارے پاس کھلی نشانیاں اور یہ حکم لے
            کر آئے جو تم کہتے ہو پھر تم نے انہیں کیوں شہید کیا اگر سچے ہو (سورۃ
            آل عمران:183)
          </Typography>
          <Typography variant="h5">
            یہاں اگر اس کا پس منظر بیان کردیا جائے تو پڑہنےوالوں کا ابہام دور ہو
            جائے گا ۔ مذکورۃ آیت کاشانِ نزول: یہود کی ایک جماعت نے سید عالم صلی
            اللہ علیہ وآلہ وسلم سے کہا تھا کہ ہم سے توریت میں عہد لیا گیا ہے کہ
            جو مدعی رسالت ایسی قربانی نہ لائے جس کو آسمان سے سفید آگ اتر کر
            کھائے اس پر ہم ہرگز ایمان نہ لائیں اس پر یہ آیت نازل ہوئی اور ان کے
            اس کذب محض اور افتراء خالص کا ابطال کیا گیا کیونکہ اس شرط کا توریت
            میں نام و نشان بھی نہیں ہے اور ظاہر ہے کہ نبی کی تصدیق کے لئے معجزہ
            کافی ہے کوئی معجزہ ہو جب نبی نے کوئی معجزہ دکھایا اس کے صدق پر دلیل
            قائم ہوگئی اور اس کی تصدیق کرنا اور اس کی نبوت کو ماننا لازم ہوگیا
            اب کسی خاص معجزہ کا اصرار حجت قائم ہونے کے بعد نبی کی تصدیق کا انکار
            ہے۔ جب تم نے یہ نشانی لانے والے انبیاء کو قتل کیا اور ان پر ایمان نہ
            لائے تو ثابت ہوگیا کہ تمہارا یہ دعوٰی جھوٹا ہے۔(تفسیرخزائن العرفان)
          </Typography>
          <Typography variant="h5">
            لیکن امت محمدیہ پر اللہ تعالیٰ کا یہ خاص انعام ہے کہ قربانی کی
            قبولیت کو پوشیدہ رکھا اس کے اندر حکمت یہ نظر آتی ہے کہ کہیں لوگ ایک
            دوسرے کو تانے بانے دیں گے اور فساد پھیلنے لگے لگا اور آج کل تو ویسے
            بھی امت آزمائش میں ہے اور لوگوں کی حس بھی بیدار نہیں اور جہاں جس کا
            داؤ لگتا ہے لگا لیتا ہے ۔دوسرا قربانی کے گوشت کھانے کی اجازت مرحمت
            فرما دی ۔لیکن ساتھ ہی یہ وضاحت فرما دی کہ قربانی کا مقصد اور اس کا
            فلسفہ گوشت کھانا نہیں بلکہ ایک حکم شرعی کی تعمیل اور سنت ابراہیمی پر
            عمل کرتے ہوئے ایک جان کو اللہ کی راہ میں قربان کرنا ہے۔ چنانچہ واضح
            الفاظ میں فرمایا:۔ یعنی اللہ کے پاس ان قربانیوں کا گوشت نہیں پہنچتا
            اور نہ خون پہنچتا ہے بلکہ تمہارا تقویٰ پہنچتا ہے “ (سورۃ الحج:37)
          </Typography>
          <Typography variant="h5">
            اور اسی کی تائید ہمیں نبی کریم ﷺ کے فرمان سے ملتی ہے: فرمایا! بے شک
            اللہ تعالیٰ تمہاری طرف اور تمہارے اموال کی طرف نہیں دیکھتا بلکہ وہ
            تو تمہارے دل کی نیت کو دیکھتا ہے‘‘(ابن ماجہ)
          </Typography>
          <Typography variant="h4" marginY={5}>
            : اور قربانی کو اللہ تعالی نے شعائر اللہ کے ساتھ تعبیر فرمایا ہے
          </Typography>
          <Typography variant="h5">
            ’’اور جو اللہ کی نشانیوں کی تعظیم کرے تو یہ دلوں کی پرہیزگاری سے
            ہے‘‘ (سورۃ الحج: 32)
          </Typography>
          <Typography variant="h5">
            یعنی قربانی کا گوشت کھانا کوئی مقصد نہیں بلکہ سنت ابراہیمی پر عمل
            کرتے ہوئے خالص اللہ کے لئے جان قربان کرنا اصل مقصد ہے۔تعمیل اور سنت
            ابراہیمی ؑ پر عمل کرتے ہوئے ایک جان کو اللہ کی راہ میں قربان کرنا
            ہے۔ چنانچہ واضح الفاظ میں فرمایا: یعنی قربانی کا گوشت کھانا کوئی
            مقصد نہیں بلکہ سنت ابراہیمی پر عمل کرتے ہوئے خالص اللہ کے لئے جان
            قربان کرنا اصل مقصد ہے قرآن حکیم میں ارشاد ہوا ؛
          </Typography>
          <Typography variant="h5">
            ”یعنی جب ابراہیمؑ کا بیٹا اسماعیل علیہ السلام اس قابل ہو گیا کہ باپ
            کے ساتھ چل کر ان کے کاموں میں مدد گار بن سکے تو حضرت ابراہیمؑ نے
            کہا: اے میرے پیارے بیٹے! میں نے خواب میں دیکھا ہے کہ میں تجھے ذبح کر
            رہا ہوں، بتاﺅ کہ تمہاری کیا رائے ہے؟ سعادت مند بیٹا بھی تو خلیل اللہ
            کا بیٹا تھا۔ کہنے لگے: ابا جان آپ وہ کام کر گزریں جس کا آپ کو حکم
            دیا گیا ہے۔ آپ انشاءاللہ مجھے صبر کرنے والوں میں سے پائیں گے۔ (سورۃ
            الصافات:101) ”جب باپ بیٹا قربانی کے لئے تیار ہو گئے اور باپ نے بیٹے
            کو قربان کرنے کے لئے چہرہ کے بل کروٹ پر لٹا دیا (الصافات:103) " تو
            ارشاد باری تعالیٰ ہے:۔
          </Typography>
          <Typography variant="h5">
            اور ہم نے اس کو ندا دی اے ابراہیم (سورۃ الصافات:104) ”اے ابراہیم آپ
            نے خواب کو سچا کر دکھایا، اس کے ساتھ ہی ایک دنبہ حضرت اسماعیلؑ کے
            بجائے قربانی کے لئے نازل کر دیا“(سورۃ الصافات:105) اللہ تعالیٰ نے
            اپنے محبوب پیغمبر ابراہیم خلیل اللہ کے اس عمل کو پسند فرما کر قیامت
            تک ان کی یاد کو زندہ رکھنے کے لئے قربانی ہر صاحب استطاعت پر واجب کر
            دی.
          </Typography>
          <Typography variant="h4" marginY={5}>
            : قربانی کرنے پر فضیلت اور نہ کرنے پر وعید
          </Typography>

          <Typography variant="h5">
            حضرت زید بن ارقم رضی اللہ عنہ کہتے ہیں: رسول اللہ صلی اللہ علیہ وآلہ
            وسلم سے صحابہ کرام رضوان اللہ علیہم اجمعین نے عرض کی یارسول اللہ! یہ
            قربانیاں کیا ہیں؟ فرمایا تمہارے باپ ابراہیم علیہ السلام کی سنت ہے
            انہوں نے عرض کی یارسول اللہ ہمارے لئے ان میں کیا ثواب ہے؟ فرمایا ہر
            بال کے بدلے نیکی عرض کی یارسول اللہ! اون کے متعلق کیا ارشاد ہے؟
            فرمایا اون کے بال کے بدلے میں بھی نیکی ملے گی( سنن ابن ماجہ)
          </Typography>
          <Typography variant="h5">
            حضرت سیدنا ابو ہریرہ رضی اللہ عنہ فرماتے ہیں نبی کریم صلی اللہ علیہ
            وآلہ وسلم نے فرمایا جو وسعت کے باوجود قربانی نہ کرے وہ ہماری عید گاہ
            کے قریب بھی نہ آے.(سنن ابن ماجہ)
          </Typography>
          <Typography variant="h4" marginY={5}>
            : حضور نبی کریم علیہ الصلاۃ والسلام کا اپنی امت کے غریبوں پر شفقت
          </Typography>
          <Typography variant="h5">
            ہمارے پیارے نبی کریم علیہ الصلاۃ والسلام پر ہمارے ماں، باپ قربان
            ہوں، جنہوں نے ہمیں ہر لمحہ یاد رکھا اور قربانی جیسے مقدس فریضہ کو
            ادا کرتے ہوئے آپ علیہ الصلاۃ والسلام نے ان امتیوں پر شفقت فرمائی تا
            قیامت تک آنے والےغرباء کی طرف سے قربانی ادا فرماگئے تاکہ کوئی امتی
            اپنے دل میں یہ بات نہ لائے ، کاش کہ مجھے بھی اللہ تعالی مال و دولت
            سے نوازتا او ر میں بھی اس فریضہ کو بجا لا کر اللہ کو راضی کرتا تو جن
            کو اللہ نے استطاعت نہیں دی قربانی کرنے کی ان کو پریشان ہونے کی بجائے
            خوش ہونا چاہیے کہ اللہ کے محبوب ﷺ نے ان کی طرف سے پہلے ہی ادائیگی
            فرما دی ہے۔
          </Typography>
          <Typography variant="h5">
            ’’اے اللہ قبول کر محمد (صلی اللہ علیہ وآلہ وسلم) کی طرف سے، آل محمد
            (صلی اللہ علیہ وآلہ وسلم) کی طرف سے، امت محمدی (صلی اللہ علیہ وآلہ
            وسلم) کی طرف سے پھر آپ نے قربانی کی‘‘۔ (صحیح مسلم)
          </Typography>
          <Typography variant="h5">
            اس پر محدثین کرام اور فقہاء دین کا کہنا ہے کہ اس طرح حضور صلی اللہ
            علیہ وآلہ وسلم نے اپنی پوری امت کو قربانی کے ثواب میں شامل کرلیا۔ آپ
            صلی اللہ علیہ وآلہ وسلم وہ سراپا رحمۃ اللعلمین نبی ہیں کہ عمل قربانی
            کے دائرے میں بھی چاہتے ہیں کہ ان کے سارے امتی شریک ہوجائیں۔ ایک حدیث
            مبارکہ میں ذبح کرتے وقت آپ سے یہ الفاظ منسوب فرمائے گئے ہیں۔ هذا عنی
            ، وهذاامتی. (حاشیہ صحیح مسلم : 1562) ’’یہ میری طرف سےاورمیری آل کی
            طرف سے اور میری امت کی طرف سے ہے‘‘۔ آپ صلی اللہ علیہ وآلہ وسلم نے
            فرمایا : باری تعالیٰ یہ قربانی میری طرف سے ہے اور یہ قربانی میرے ان
            امتیوں کی طرف سے ہے جو افلاس کی وجہ سے قربانی نہیں کرسکتے۔ ہمیں بھی
            قربانی کرتے وقت نبی کریم صلی اللہ علیہ وآلہ وسلم کو اس میں شریک کرنا
            چاہئے اور یہی محبت کا تقاضہ ہے جس کی تصدیق حضرت علی رضی اللہ عنہ کے
            عمل سے ہوتی ہے ، جسکا مفہوم یہ ہے: صاحب لولاک ﷺ کے ظاہری وصال کے بعد
            اپنی شہادت تک د و قربانیاں کرتے تھے ایک اپنی طرف سے اور ایک اپنے
            حبیبﷺ کی طرف سے(ترمذی)۔
          </Typography>
          <Typography variant="h4" marginTop={5} marginBottom={2}>
            : قربانی کی حکمتیں اور ان کے فوائد
          </Typography>
          <Typography variant="h5">
            : مفتی احمد یار خاں نعیمی رحمۃ اللہ علیہ فرماتے ہیں
          </Typography>

          <ol>
            <li>
              <Typography variant="h5">
                1. خدا داد نعمتوں پر شکر ادا کرنے کا بہترین طریقہ یہ ہے کہ اس کے
                حکم پر خلق خدا کے لئے بہترین کھانے کا بندوبست کریں۔
              </Typography>
            </li>
            <li>
              <Typography variant="h5">
                2. قربانی دینے والے ہی حق کی حمایت اور ظلم کی بیخ کنی کے لئے وقت
                آنے پر تن من دھن وطن اولاد سب کچھ قربان کرسکتے ہیں اور یہی جذبہ
                قوموں کی باوقار زندگی کا ضامن ہے۔
              </Typography>
            </li>
            <li>
              <Typography variant="h5">
                3. مغرب نے جو ظالمانہ استحصالی نظام ہم پر مسلط کر رکھا ہے، اس نے
                غریب کو باعزت زندگی سے محروم کررکھا ہے۔ اشیاء خورد و نوش اتنی
                مہنگی کردی گئیں کہ اللہ کی نعمتوں کے دروازے عوام پر بند ہیں۔
                اسلام کا نام لینے والے حکمرانوں نے اپنے عوام کے منہ سے آخری لقمہ
                بھی چھین لیاہے۔ رب العالمین کی ربوبیت اور رحمۃ اللعالمین کی رحمت
                کو امراء نے غصب کر رکھا ہے۔ اس کو رب کائنات کے بجائے رب اغیاء
                اور رحمت عالمیاں کے بجائے رحمت سرمایہ دار ان تک محدود کر چھوڑا
                ہے حالانکہ قرآن کاحکم ہے۔ ولا تفسدوا فی الارض۔ اور زمین میں فساد
                برپا نہ کرو۔
              </Typography>
              <Typography variant="h5">
                یہ لوگ اللہ کا پیدا کیا ہوا وافر رزق ذخیرہ اندوزی کے ذریعہ سٹاک
                کرتے اور کھلے بازار میں آنے سے روکتے اور مصنوعی قلت پیدا کرکے
                آئے دن بھاؤ بڑھاتے رہتے ہیں۔ جس سے عوام بنیادی ضروریات سے محروم
                ہوتے جاتے ہیں اور بڑے لوگ اپنی تجوریاں بھرتے رہتے ہیں۔ قربانی کا
                شرعی حکم ان انسان نمادرندوں کو مذموم حرکت سے باز رکھنے کا سبق
                دیتا ہے تاکہ غریب آدمی بھی اللہ کی نعمت (گوشت) کھاسکے۔ پس اسلامی
                نظام کو جہاں بھی نافذ العمل کرو گے، ظلم کے اندھیروں میں تمہیں
                روشنی کی کرن وہیں نظر آنے لگے گی۔ ایک قربانی پر عمل درآمد نے کم
                از کم تین دن، کروڑ محروم لوگوں کو اعلیٰ کھانا کھلادیا۔
              </Typography>
            </li>
            <li>
              <Typography variant="h5">
                4. قربانی کی کھالوں سے بیشمار رفاہی خیراتی ادارے چلتے ہیں۔
                غریبوں یتیموں اور بیواؤں کی مالی پریشانیاں دور ہوتی ہیں۔
              </Typography>
            </li>
            <li>
              <Typography variant="h5">
                5. سرمایہ داروں کے دل سے دولت کی محبت کم اور خالق کی محبت اور
                خلق پر شفقت کے جذبات بڑھتے ہیں اور یہی انسانیت کا اصل جوہر ہے۔
              </Typography>
            </li>
            <li>
              <Typography variant="h5">
                6. قربانی کی نیت سے ہزاروں لوگ مال مویشی پالتے اور وقت آنے پر
                اپنی محنت کا پھل پاتے ہیں۔ اس سے ان کی سال بھر کی روزی کا سامان
                ہوجاتا اس کی کھال بال اور ہڈیاں قومی آمدنی میں اضافے کا سبب ہیں۔
                الغرض جس پہلو سے دیکھا جائے قربانی اپنے اندر دنیا و آخرت کے
                بیشمار فوائد و فضائل رکھتی ہے۔
              </Typography>
            </li>
          </ol>

          <Typography variant="h4" marginY={5}>
            : قربانی سے متعلق ذہنوں کے اختراع کردہ شبہات اور ان کے مؤثر جوابات
          </Typography>
          <Typography variant="h5">
            ذہنوں کے اختراع کردہ شبہات اگر علمی پہلو اور گہرے مطالعہ کی روشنی
            میں ہوں تو ان کی سماعت کے بعد مسرت ہوتی ہے اور اگر ہٹ دھرمی کی نوعیت
            سے ہوں تو اس کے دو نقصان ہوتے ہیں ایک تو معاشرہ کے اندر فساد اور
            دوسرا اپنی آخرت کو نقصان۔ ایسی ہی نوعیت کچھ قربانی سے متعلق ابھرتے
            ہوئے شبہات کی ہے۔ بڑے زور شور سے یہ کہا جاتا ہے کہ قربانی کرنے کی
            وجہ سے جانوروں کی نسل کشی ہوتی ہے اور فضول میں اتنا پیسا خرچ کیا
            جاتا ہے اگر یہ پیسہ فلاحی کاموں پر لگایا جائے مثلا: کشمیر فنڈ ،
            استحکام پاکستان ، امداد مہاجرین ، دہشت گردی ،قومی ترقی ،ملکی ضروریات
            وغیرہ کے خاتمے کے لیے عمل میں لایا جائے اور یہ بھی کہاجاتا ہے کہ
            قربانی صرف اور صرف حاجیوں کے لیے ہے جس کا ذکر قرآن میں آیا ہے کہ
            قربانی مکہ میں دی جائے اور نیز یہ بھی کہا جاتا ہےکہ جب قربانی باری
            تعالی تک نہیں پہنچتی تو پھر کیوں کی جاتی ہے ؟
          </Typography>
          <Typography variant="h5">
            اگر ان شبہات کوبغور پڑھا جائے تو ان میں کچھ حقیقت نہیں اوران شبہات
            کے اختراع ہونے کی اصل وجہ دورئ اسلام ہے اور فلسفہ مغرب تو اتنا پڑھا
            کہ مغرب کو پڑھا سکتے ہیں مگر اسلام کو چھوا تک نہیں اور دوسری زبانیں
            تو اتنی پڑھیں کہ فصاحت وبلاغت کے پھول برسانے کی کوشش کرتے ہیں مگر وہ
            زبان جو انسان کے لیے باعث نجات ہے وہ سیدھی طرح سے چند الفاظ بھی
            بولنےنہیں آتے، اور کچھ قرآن پڑہنے والوں کا یہ حال ہے کہ قرآن کی
            تعبیر کرنے میں اپنے پیش کردہ نظریات کو حرف آخر سمجھتے ہیں ،تو یہ وہی
            لوگ ہیں جن کو قرآن نے گمراہ کردیا ہے جیسے باری تعالی کا فرمان ہے
            (یضل بہ کثیرا ویھدی بہ کثیرا) بہت سارے لوگ اس قرآن کے ساتھ گمراہ
            ہوتے ہیں اور بہت سارے لوگ ہدایت پاتے ہیں۔ تو گمراہ قرآن کو پڑھ کروہی
            ہوتے ہیں جن کے دل کے اندر کجی ہے اور جو لوگ قرآن کو اللہ کا کلام جان
            کر پڑہتے ہیں وہ خود بھی ہدایت حاصل کرتے ہیں اور دوسروں کے لیے بھی
            ہدایت کا زریعہ بنتے ہیں ۔ قربانی کا حکم اللہ تعالی کےفرمان سے ملتا
            ہے ، فرمان باری تعالی ہے (ویعلمہم الکتاب والحکمۃ) اس آیت کریمہ کے
            اندر حکمت کا لفظ آیاہے اور اس حکمت سے مراد مفسرقرآں امام ابن عطیہ نے
            اپنی تفسیر (المحررالوجیز) میں سنت مراد لیا ہے اور کتاب قانون ہے اور
            حکمت اس کی تشریح ہے جسے دوسرے لفظوں میں حدیث سمجھ لیجیے۔اور فرمان
            باری تعالی ہے (اور جو کچھ تمہیں رسول عطا کریں وہ لے لو اور جس سے
            روکیں اس سے باز رہو(سورۃالحشر:7)۔ اور جس قانون کی تشریح موجود نہ ہو
            وہ قانون کس کام کا۔ اور پانچ لاکھ لوگوں نے سیرت رسول ﷺ کا نقشہ
            کھینچا ہے، اور قرآن محتاج نہیں بلکہ ہم قرآن پر عمل کرنے کے لیے حدیث
            کے محتاج ہیں ، کیونکہ قانون عمل کرنے والوں کا محتاج نہیں ہوتا بلکہ
            عمل کرنے والے قانون کے محتاج ہوتے ہیں، دیکھیئے خدا کی معرفت رسول کے
            بغیر ناممکن ہے تو اس کا یہ مطلب نہیں کہ خدا اپنی معرفت کرانے میں
            رسولوں کا محتاج ہے بلکہ ہم رسولوں کے محتاج ہیں اور حدیث قرآن کی ہی
            تشریح ہے جیساکہ حضرت عبد اللہ ابن مسعود رضی اللہ عنہ سے مروی ہے: کہ
            گودنے والی اور گدوانے والی عورتیں منہ پر سے بال نچوانے والی عورتیں،
            افزائش حسن کے لئے دانتوں کو سوہان (ریتی ) سے رتوانے والی عورتیں ان
            سب پر کہ جو اللہ کی بنائی ہوئی چیزوں میں تغیر کرتی ہیں اللہ تعالیٰ
            نے لعنت فرمائی ہے۔ (جب ابن مسعود رضی اللہ تعالیٰ عنہ کی یہ روایت
            عورتوں تک پہنچی ) تو ایک عورت حضرت ابن مسعود رضی اللہ تعالیٰ عنہ کے
            پاس آئی اور کہنے لگی کہ مجھ تک یہ بات پہنچی ہے کہ آپ اس طرح (کی
            عورتوں پر) لعنت بھیجتے ہیں؟ حضرت ابن مسعود رضی اللہ تعالیٰ عنہ نے
            فرمایا کہ میرے لئے کیا رکاوٹ ہے کہ میں اس پر لعنت نہ بھیجوں جس پر
            رسول کریم صلی اللہ علیہ وسلم نے لعنت فرمائی ہے، اور جس کو کتاب اللہ
            میں ملعون قرار دیا گیا ہے عورت نے کہا کہ میں نے بھی اس چیز کو پڑھا
            ہے جو دو دفتیوں کے درمیان ہے (یعنی میں نے بھی پورا قرآن کریم پڑھا
            ہے) لیکن اس میں مجھے یہ بات جو آپ کہتے ہیں (صریح الفاظ میں ) کہیں
            نہیں ملی ہے؟ حضرت ابن مسعود رضی اللہ تعالیٰ عنہ نے فرمایا ۔" اگر تم
            قرآن کریم کو غور و فکر کے ساتھ اور سمجھ کر پڑھتیں تو اس میں تمہیں
            یقینا اس کا حکم ملتا ، کیا تم نے یہ آیت نہیں پڑھی ہے یعنی رسول کریم
            صلی اللہ علیہ وسلم تمہیں جو کچھ دیں اس کو قبول کرو اور اس پر عمل
            کرو، اور جس چیز سے تمہیں منع کریں اس سے باز رہو ) (الحشر :7) اس عورت
            نے کہا کہ ہاں یہ آیت تو میں نے پڑھی ہے ۔ حضرت ابن مسعود رضی اللہ
            تعالیٰ عنہ نے فرمایا کہ " پس یہ وہ چیز ہے جس سے آنحضرت صلی اللہ علیہ
            وسلم نے منع فرمایا ہے ۔" (بخاری ومسلم )
          </Typography>

          <Typography variant="h5">
            اور معترض کے ذہن میں یہ بات ضرور رہے کہ قرآن مجید اللہ رب العزت نے
            اپنے پیارے محبوب ﷺ پرحضرت جبریل علیہ السلام کے توسط سے نازل فرمایا
            اور صحابہ کو تعلیم قرآن اللہ کے رسول ﷺ نے دی اسی طرح واسطہ در واسطہ
            سے قرآن ہم تک پہنچا ہے ۔ اگر تھوڑی سی عقل سے کام لیا جائے تو انسان
            یہ سوچنے پر مجبور ہوجائےگا کہ کتنی عجیب بات ہے کہ اس قرآن کو تو
            مانتے ہوجس کو اللہ کے رسول ﷺ نے بتایا کہ یہ اللہ کا قرآن ہے مگر جو
            اللہ کے محبوب کا فرمان ہے اسے مان نے کے لیے تیار نہیں یہ تو بڑی
            مضحکہ خیز بات ہے صاحب عقل والوں کے لیے۔
          </Typography>
          <Typography variant="h5">
            اور قرآن کا مطالعہ کریں تو اس نتیجہ تک انسان پہنچتا ہے کہ قرآن کو
            سمجھنے کے لیے حدیث کو سمجھنا ضروری ہے جیسا کہ اللہ تعالی نے ارشاد
            فرمایا : ( حرمت علیکم المیتۃ والدم ولحم الخنزیر) تم پر مردہ اور دم
            مسفوح اور خنزیر کا گوشت حرام کیا گیا ہے ، چوہے، کتے ، بلی وغیرہ
            حشرات الارض اور سباع بہائم وطیور کی حرمت کی تفصیلات کا ذکر نہیں ، جن
            کی تفصیل حدیث سے ملتی ہے تو کیوں نہیں کھاتے ان مذکورہ جانوروں کو؟۔
            جب نبی کریم ﷺ سے سوال کیا گیا کہ یاروسول اللہ ﷺ یہ قربانیاں کیا ہیں؟
            تو نبی کریم ﷺ نے ارشاد فرمایا: (سنۃ ابیکم ابراہیم) یہ تمہارے باپ
            حضرت ابراہیم علیہ السلام کی سنت ہے ، اور یہ کہنا کہ قربانی مکہ میں
            ہو سکتی ہے تو یہ بھی صحیح نہیں کیونکہ قرآن میں تو جو ذکرآیا ہے
            قربانی کا وہ یہ ہے کہ اپنے ہدایا بیت العتیق اور کعبہ تک پہنچاؤ تو
            بیت العتیق اور کعبہ ایک مخصوص جگہ کا نام ہے جسکو حرم کے نام سے بھی
            یاد کیا جاتا ہے اور لفظ مکہ کا احاطہ ایک شہر پر ہوتا ہے ، جبکہ
            قربانیاں حرم کے اندر نہیں کی جاتی بلکہ منی جو کئی میل دور ہے وہاں
            پرقربانی کی جاتی ہے تو یہ کہنا کہ قربانی حرم کے ساتھ خاص ہے تو یہ
            شبہ بے فائدہ ہے۔ اور معترض کو اگر یہ اعتراض ہے توحج کے دنوں کا تذکرہ
            کونسی آیات میں آیا ہے کہ حج ان مخصوص دنوں میں کیا جائے اس کو بھی
            متغر سمجھو حالانکہ اس پر کوئی نہیں بولتا۔ اور یہ بات بھی ذہن میں رہے
            کہ قربانی کا لفظ عام ہے اور حجاج جو قربانی کرتے ہیں اس کے لیے ایک
            خاص لفظ "ہدایا "ہے جسکا تذکرہ گزر چکا۔ اور قربانی اللہ تعالی کو
            پہنچتی ہے جیسا کہ قرآن میں آچکا ہے :کہ اللہ تعالی کو گوشت اور خون
            نہیں پہنچتا بلکہ اللہ تعالی کو تمہارا تقوی پہنچتاہے۔
          </Typography>
          <Typography variant="h5">
            ہر مسلمان جانتا ہے کہ اصل دین توحید ہے اور توحید کی ضد شرک ہے، ہمارے
            پیارے نبی ﷺ جس دور میں پیدا ہوئے وہ کسی سے مخفی نہیں ۔ ملت ابراہیمی
            کی حقیقت کفروشرک کی تاریکیوں میں گم ہو کر رہ گئی تھی، ایک خدا کی
            بجائے ہزاروں نہیں بلکہ لاکھوں خداؤوں کو پوجا جانے لگا۔ پرستش اور
            بندگی کے جتنے طریقے اللہ تعالی کے لیے ہو سکتے تھے وہ سب باطل خداؤوں
            کے لیے مخصوص ہو چکے تھے۔ مالی اور بدنی عبادتیں بتوں کے لیے مخصوص
            تھیں اور مشرکین اپنے بتوں کی جو بدنی عبادت کرتے تھے اس میں تین چیزیں
            نمایاں تھیں(1) سجدہ (2) دعائیں (3) اور اپنی زبانوں سے ان کی بزرگی
            بیان کرنااور عبادت مالی میں جو چیز سب سے زیادہ نمایاں تھی وہ بتوں کے
            نام پر جانوروں کا ذبح کرنا تھا اور اگر یہ کہا جائے کہ وہ اپنی اولاد
            کوبھی قربان کردیتے تھے تو غلط نہ ہوگا جیساکہ امیر المؤمنین حضرت عمر
            فاروق رضی اللہ عنہ کے دور خلافت میں مصر کا دریا ئے نیل خشک ہو گیا ۔
            مصری رعایا مصر کے گورنر صحابی رسول ﷺ حضرت عمروبن العاص رضی اللہ
            تعالی عنہ کی خدمت میں فریاد لے کر حاضر ہوئی اور عرض کی کہ اے امیر!
            ہمارا یہ دستور رتھا کہ جب دریائے نیل خشک ہو جاتا تھا تو ہم لوگ ایک
            خوبصورت کنواری لڑکی کو دریا میں زندہ درگو کرکے دریا کی بھینٹ چڑھایا
            کرتے تھے ۔ اس کے بعد دریا پھر جاری ہوا کرتا تھا اب ہم کیا کریں؟
            گورنر نے فرمایا کہ اللہ تبارک وتعالی اور اس کے رحمت والے رسول ﷺ کا
            رحمت بھرا دین اسلام ہرگز ایسے ظالمانہ اور جاہلانہ فعل کی اجازت نہیں
            دیتا ۔ تم لوگ انتظار کرو میں امیرالمؤمنین حضرت عمر فاروق رضی اللہ
            عنہ کو خط لکھتا ہوں وہاں سے جو حکم ملےگا اس پر عمل کیا جائےگا۔
            چنانچہ گورنر کا قاصد مدینۃ الرسولﷺ آیا اور دریائے نیل کے خشک ہونے کا
            حال سنایا۔امیرالمؤمنین یہ خبر سن کر نہ گھبرائے نہ پریشان ہوئے بلکہ
            نہایت ہی سکون اور اطمینان کے ساتھ ایک ایسا تاریخی خط لکھا جیسے کوئی
            انسان دوسرے انسان کو خط لکھ کر اس سے مخاطب ہوتا ہے ۔ الی نیل مصر من
            عبد اللہ عمربن الخطاب : اما بعد فان کنت تجری بنفسک فلا حاجۃ لنا الیک
            وان کنت تجری بااللہ فانجر علی اسم اللہ۔اے دریائے نیل ! اگر تو خود
            بخود جاری ہوا کرتا تھا تو ہم کو تیری ضرورت نہیں ہے اور اگر تو اللہ
            تعالی کے حکم سے جاری ہوتا تھا تو میں امیر المؤمنین ہو کر تجھ کو حکم
            دیتا ہوں کہ تو پھر اللہ تعالی کے نام پر جاری ہوجا۔(ازالۃ الخفاء
            جلد:دوئم) یہ خط لفافہ میں بند کر کے قاصد کو دیا اور فرمایا اس کو
            دریائے نیل میں ڈال دیا جائے ۔ چنانچہ جوں ہی آپ رضی اللہ عنہ کا خط
            دریائے نیل میں ڈالا گیا تو دریا فورا جاری ہوگیا اور ایسا جاری ہوا کہ
            آج تک خشک نہیں ہوا۔تو یہ رسم ورواج اور ذاتی مفاد کی خاطر جو قربانی
            دی جاتی تھیں سب کا خاتمہ کردیا اسلام نے اور واضح کردیا کہ قربانی وہ
            ہوتی ہے جو اللہ کے عطاکردہ حلال مال سے میری رضا حاصل کرنے کے لیے کی
            جائے جس کا پرچار اللہ کے حکم سے آپ ﷺ نے جاری فرمایا۔
          </Typography>
          <Typography variant="h5">
            دین اسلام جس کی بنیاد خالص توحید پرتھی تو اس وجہ سے عبادت مالی اور
            بدنی صرف اللہ تعالی کے لیے خاص کردی جائے، اور یہ بات اچھی طرح ذہن
            نشین ہوجائے کہ عبادت چاہے بدنی ہو یا مالی ہو وہ صرف اللہ تعالی کی
            ذات کے لیے ہوسکتی ہے اور اسی حکمت کے تحت عبادت مالی کا نمایاں پہلو ،
            معبودوں کے نام پر جانوروں کو ذبح کرنا، بتوں سے ہٹا کر معبود برحق
            تعالی جل مجدہ کے لیے مخصوص کیا گیا اور شعائر دینی کی صورت میں
            اجتماعی عبادت کی شکل دےکر ہر ہر شہر ور قریہ میں اس کو جاری کردیا
            گیا۔ اورنہ ہی یہ قربانی کا فلسفہ اجتماع حج کے موقعہ پر غذائی سہولت
            ہے۔ اور اگر قربانی کے موقعہ پر گوشت کو فرمان رسول ﷺ کے مطابق تقسیم
            کیا جائے تو، گوشت تو گھر میں بقدر ضرورت بچتاہے۔اگر قربانی پر آپکو
            شبہ ہے تو سلطنت پر جو روپیہ خرچ کیاجاتاہے تو معترض کی نظر میں وہ بھی
            بے فضول ہے اور اس کو اس بے فضولی کا پتہ نہیں چلے گا ۔ جب دفاعی لائن
            کمزور ہونے کی وجہ سے دشمن سرپرآن پہنچے گا اور قتل وغارت کا بازار گرم
            ہونےلگے گا تب کچھ ہاتھ نہیں لگے گا۔ تو اسی طرح شعائر دین کو باقی
            رکھنے کے لیے جو روپیہ خرچ کیا جاتا ہے اس پر اعتراض کرنے والے اس وقت
            سر پکڑ روئیں گے جب مسلمانوں کی لاپرواہی کے سبب شعائر دین ختم ہوجائیں
            گےاور توحید کی جگہ شرک لے ،لےگا ۔ دین ختم ہو کر کفر وبے دینی کادور
            دورہ ہوگااور اسی وقت عذاب الہی کی گرفت سخت ہو جائےگی۔ قربانی پر خرچ
            ہونے والا روپیہ پر اعتراض کرنےوالے ذرا اس پر غورو فکر کریں جو قربانی
            دینے لاکھوں بلکہ کڑوروں درجہ زیادہ سینماؤں ، تیھڑوں ، کلب گھروں ،
            جوا خانوں اور اسراف تبذیر کی بے شمار مدوں پر مسلمانوں کے گاڑھےپسینے
            کی کمائی کا روپیہ جو خرچ ہوتا ہے ، روزہ رکھنا بھی بظاہر کمزوری کا
            سبب ٹھرے گا جو کہ طاقت کی بجائے انسان کو کمزور کردے گا ، زکوۃ بھی بے
            معنی ہوگی کیوں کہ ٹیکس سسٹم موجود ہے۔ اس کے بعد زکوۃ دینے کی ضرورت
            نہیں ہے ۔ نبی کریم ﷺ اور صحابہ رضی اللہ عنہم اجمعین کا یہ طریقہ رہا
            ہے کہ وہ قربانی مکہ معظمہ اور مدینہ کے علاوہ بھی قربانی کرتے تھے۔
            (مقالات سيد أحمد سعيد : سید احمد سعید)
          </Typography>
        </Container>
      </Box>
    </>
  );
}

export default Article_01;
